In [1]:
import numpy as np
import pandas as pd

In [6]:
df = pd.read_excel('./files/workers.xlsx')
df

  Unnamed: 0  Maas   Yas  Departman
0       Enes   100  40.0    Yazılım
1       Seda   150  50.0      Satış
2     Zülküf   200  30.0        NaN
3      Tarık    50  10.0  Pazarlama
4      Atlas   150   NaN     Finans
5      Fatma   200  25.0      Hukuk

In [9]:
fillValuesdf = df.dropna()
fillValuesdf

  Unnamed: 0  Maas   Yas  Departman
0       Enes   100  40.0    Yazılım
1       Seda   150  50.0      Satış
3      Tarık    50  10.0  Pazarlama
5      Fatma   200  25.0      Hukuk

In [11]:
fillValuesdf.to_excel('files/fillworkers.xlsx')